{
  "metadata": {
    "title": "Roberto Justo | IT Portfolio",
    "description": "Professional portfolio of Roberto Justo - Front-End Tech Lead specialized in Salesforce, with experience in national and international B2B e-commerce projects."
  },
  "nav": {
    "home": "Home",
    "personal": "About Me",
    "projects": "Projects",
    "skills": "Skills",
    "contact": "Contact",
    "curiosities": "Curiosities"
  },
  "header": {
    "menu": "Menu",
    "closeMenu": "Close menu",
    "selectLanguage": "Select language"
  },
  "footer": {
    "madeBy": "Developed by",
    "allRights": "All rights reserved.",
    "language": "Language"
  },
  "home": {
    "title": "Home",
    "heroTitle": "Hello, I'm",
    "heroName": "Roberto Justo",
    "heroSubtitle": "Front-End Tech Lead & Salesforce Developer",
    "heroDescription": "With years of experience in web development, I specialize in building and architecting Salesforce applications, focused on B2B e-commerce for national and international clients. I lead front-end teams, collaborating with different squads to deliver efficient and scalable solutions.",
    "storiesTitle": "My Journey",
    "storiesSubtitle": "Key milestones in my career",
    "summaryTitle": "Professional Summary",
    "summaryText": "Front-End Tech Lead with solid experience in web development and Salesforce application architecture. My work goes beyond code: I participate in strategic meetings, use agile methodologies, and contribute to technical decisions. I meet directly with clients and DevOps teams, ensuring solutions are aligned with business needs. Committed to best practices, quality, performance, and innovation, I currently also build features and projects with artificial intelligence, using AI agents to ensure better quality, testing, agility, and scalability.",
    "summaryHighlight1": "Years of Experience",
    "summaryHighlight2": "Projects Delivered",
    "summaryHighlight3": "Global Markets",
    "summaryHighlight4": "Technologies Mastered",
    "viewProjects": "View Projects",
    "contactMe": "Contact Me",
    "stories": {
      "story1": { "title": "University", "year": "2010", "description": "Enrolled in Information Systems at UFRRJ, after an excellent score on the national exam and technical training at FAETEC" },
      "story2": { "title": "First Internships", "year": "2011", "description": "IT internships at UFRRJ (DTA and COINFO), network maintenance and web portal development" },
      "story3": { "title": "Corporate Experience", "year": "2013", "description": "Internships at Hildebrando Brasil and Globo.com, working with infrastructure and operating systems" },
      "story4": { "title": "University Instructor", "year": "2014", "description": "Instructor at CODEP/UFRRJ, teaching Spreadsheet courses to university employees for 2 years" },
      "story5": { "title": "Development Trainee", "year": "2017", "description": "Trainee at HS Informática, working with product support and web application development in PHP with MVC framework" },
      "story6": { "title": "Entering Salesforce", "year": "2018", "description": "Joined iPremios as a Salesforce Developer, styling B2B portals for major clients" },
      "story7": { "title": "Global Projects", "year": "2020", "description": "Contributing to international projects like OmniRep and Commerce Lite for global markets" },
      "story8": { "title": "Front-End Tech Lead", "year": "2022", "description": "Promoted to Front-End Tech Lead, leading the team on the All in One project" },
      "story9": { "title": "Global Expansion", "year": "2024", "description": "Leading front-end across 5 markets: Brazil, Chile, Romania, South Africa, and Poland" },
      "story10": { "title": "AI & Innovation", "year": "2026", "description": "Building features and projects with artificial intelligence and AI agents" }
    }
  },
  "personal": {
    "title": "About Me",
    "subtitle": "Get to know my story and trajectory",
    "bio": "With years of experience in web development, I specialize in building and architecting Salesforce applications, focused on e-commerce for national and international clients. I am committed to development best practices, always seeking quality, performance, and innovation. I consider myself a polite, sociable, and determined person who values transparency and professionalism.",
    "timelineTitle": "My Timeline",
    "timelineSubtitle": "Milestones in my journey",
    "info": {
      "location": "Location",
      "locationValue": "Rio de Janeiro, Brazil",
      "education": "Education",
      "educationValue": "Information Systems - UFRRJ",
      "experience": "Experience",
      "experienceValue": "15+ years in IT",
      "languages": "Languages",
      "languagesValue": "Portuguese, English, Spanish"
    },
    "timeline": {
      "event1": { "date": "2010", "title": "University", "description": "Enrolled in Information Systems at UFRRJ, after passing the national exam and technical courses at FAETEC" },
      "event2": { "date": "2011", "title": "Internship - DTA UFRRJ", "description": "Network maintenance, web portal creation, and hardware/software support in the computer lab" },
      "event3": { "date": "2012", "title": "Internship - COINFO UFRRJ", "description": "University computer network maintenance, level 2 and 3 support" },
      "event4": { "date": "2013", "title": "Hildebrando & Globo.com", "description": "Infrastructure internships at Hildebrando Brasil and OS support at Globo.com" },
      "event5": { "date": "2014", "title": "Instructor - CODEP UFRRJ", "description": "Taught Spreadsheet course for UFRRJ employees for 2 years" },
      "event6": { "date": "2017", "title": "Trainee - HS Informática", "description": "Product support and web application development in PHP with MVC framework" },
      "event7": { "date": "2018", "title": "Salesforce Developer - iPremios", "description": "Started as Salesforce Developer, working on B2B portals for major national clients" },
      "event8": { "date": "2022", "title": "Front-End Tech Lead", "description": "Promoted to Front-End Tech Lead, leading the team on the All in One project with global reach" }
    }
  },
  "projects": {
    "title": "Projects",
    "subtitle": "Key projects I've contributed to",
    "viewMore": "View Details",
    "technologies": "Technologies Used",
    "role": "My Role",
    "duration": "Duration",
    "project1": {
      "name": "All in One (AIO)",
      "description": "Robust Salesforce portal with over 90 pages, serving as both an e-commerce platform and B2B portal. Enables retailers to purchase products, access promotions, and earn discounts. Additionally, retailers can join benefit programs, accumulating points redeemable for prizes. Deployed across 5 markets — Brazil, Chile, Romania, South Africa, and Poland — each with unique features tailored to local customer needs.",
      "role": "Front-End Tech Lead",
      "duration": "3+ years (ongoing)",
      "techs": "Salesforce LWC, Apex, JavaScript, CSS, SOQL"
    },
    "project2": {
      "name": "Commerce Lite",
      "description": "Lightweight Salesforce portal enabling BAT retailers to purchase products, access promotions, and track orders in a streamlined interface. An agile and efficient solution deployed across Brazil, Poland, Malaysia, and South Africa.",
      "role": "Front-End Developer",
      "duration": "2 years",
      "techs": "Salesforce Aura Component, Apex, JavaScript, CSS"
    },
    "project3": {
      "name": "OmniRep",
      "description": "Salesforce portal designed for BAT sales representatives, featuring visual charts for sales and purchase data organized by hierarchy — Area, Regional, Territory, and Retailer. Deployed in Brazil, South Africa, and New Zealand.",
      "role": "Front-End Developer",
      "duration": "1 year",
      "techs": "Salesforce Aura Component, JavaScript, CSS"
    },
    "project4": {
      "name": "Commerce IQ (AIO)",
      "description": "Smart feature integrated into All in One, offering products based on intelligent metrics. An engine classifies products for retailers, including: frequently purchased together items, similar products, and items not yet purchased. The portal displays these in dynamic carousels with hover interactions revealing personalized recommendations. Active in Brazil, Chile, and South Africa.",
      "role": "Front-End Developer",
      "duration": "1 year (ongoing)",
      "techs": "Salesforce LWC, Apex, JavaScript, CSS, SOQL"
    },
    "project5": {
      "name": "Promotions (AIO)",
      "description": "Feature within All in One for offering promotions on retailer purchases. Promotions are registered through an admin portal and synced to Salesforce. Users can combine multiple promotions with distinct targets and rewards, plus progressive achievement levels — the higher the target, the greater the reward. Retailers track their targets, view progress, and confirm rewards. Deployed in Brazil, Chile, and South Africa.",
      "role": "Front-End Tech Lead",
      "duration": "2+ years (ongoing)",
      "techs": "Salesforce LWC, Apex, JavaScript, CSS, SOQL, Grails, ZK"
    },
    "project6": {
      "name": "BAT Elite",
      "description": "Project integrated with All in One (Romania) from Salesforce, but built outside the Salesforce ecosystem. A B2B portal allowing users to accumulate points by achieving goals through various engagement dynamics, and redeem those points for prizes. Currently operating in the Romanian market.",
      "role": "Front-End Developer",
      "duration": "8 months (ongoing)",
      "techs": "React, Next.js"
    },
    "project7": {
      "name": "B2B Commerce",
      "description": "E-commerce portal within Salesforce for retailers, enabling product purchases linked to promotional mechanics with various discount dynamics displayed in real time. The major technical challenge was working with the CloudCraze framework, due to its inherent specificities and complexity.",
      "role": "Front-End Developer",
      "duration": "1 year",
      "techs": "CloudCraze, JavaScript, jQuery, CSS"
    }
  },
  "skills": {
    "title": "Skills",
    "subtitle": "Technical and personal competencies",
    "technicalTitle": "Technical Skills",
    "personalTitle": "Personal Skills",
    "technical": {
      "frontend": "Front-End Development",
      "backend": "Salesforce & Backend",
      "mobile": "Frameworks & Tools",
      "database": "Databases & Queries",
      "cloud": "DevOps & Methodologies",
      "architecture": "Architecture & Scalability"
    },
    "personalSkills": {
      "leadership": "Technical Leadership",
      "leadershipDesc": "Leading front-end teams in global projects across multiple markets",
      "communication": "Communication",
      "communicationDesc": "Direct meetings with clients and DevOps teams, ensuring strategic alignment",
      "problemSolving": "Problem Solving",
      "problemSolvingDesc": "Analytical approach to complex challenges in Salesforce architectures",
      "teamwork": "Teamwork",
      "teamworkDesc": "Collaboration with different teams using agile methodologies",
      "adaptability": "Adaptability",
      "adaptabilityDesc": "Working across diverse international markets with different cultures and needs",
      "creativity": "AI Innovation",
      "creativityDesc": "Building features and projects with artificial intelligence and AI agents"
    }
  },
  "contact": {
    "title": "Contact",
    "subtitle": "Let's connect and work together",
    "formTitle": "Send me a message",
    "name": "Name",
    "email": "Email",
    "subject": "Subject",
    "message": "Message",
    "send": "Send Message",
    "info": {
      "emailTitle": "Email",
      "emailValue": "justoroberto20@gmail.com",
      "phoneTitle": "Phone",
      "phoneValue": "+55 21 98372-6512",
      "locationTitle": "Location",
      "locationValue": "Rio de Janeiro, Brazil",
      "linkedinTitle": "LinkedIn"
    },
    "successMessage": "Message sent successfully!",
    "namePlaceholder": "Your name",
    "emailPlaceholder": "your@email.com",
    "subjectPlaceholder": "Subject of message",
    "messagePlaceholder": "Your message..."
  },
  "curiosities": {
    "title": "Curiosities",
    "subtitle": "Fun facts and interests about me",
    "items": {
      "item1": { "title": "Football Lover", "description": "I've been following football for as long as I can remember. I love watching competitions from around the world and get even more excited during World Cup season — a true sports enthusiast." },
      "item2": { "title": "Music", "description": "I'm passionate about music, especially classic rock and the great hits from the 70s and 80s. A good playlist is always the perfect companion for my day." },
      "item3": { "title": "Friendship", "description": "I truly value being with friends. Getting the crew together for great conversation, delicious food, and a cold beer is one of my greatest joys." },
      "item4": { "title": "Gaming", "description": "I enjoy video games, especially classics like FIFA, Mortal Kombat, and Need for Speed. I'm a retro gaming fan — Street Fighter, The King of Fighters, Gran Turismo, and other PS1 and Mega Drive titles." },
      "item5": { "title": "Continuous Learning", "description": "Every day I dedicate time to learning something new, even outside my field. Curiosity is the engine that keeps me constantly evolving." },
      "item6": { "title": "Adaptability", "description": "I adapt easily to any environment or challenge. I can handle virtually any task I'm taught and I make friends easily with all kinds of people." },
      "item7": { "title": "Family", "description": "I love my family. My world revolves around my wife Fernanda and our dog Malu. Enjoying every moment with them is what makes me happiest." },
      "item8": { "title": "Travel", "description": "I love discovering new places and living every moment of a trip to the fullest. When it's time to go back, I always wish I could stay a little longer." },
      "item9": { "title": "Driving", "description": "Surprisingly, I really enjoy hitting the road — alone or with family. Driving relaxes me and makes me feel great. I'm also a fan of classic cars; if I could, I'd own a vintage model just as a hobby." }
    }
  }
}
