{
  "metadata": {
    "title": "Roberto Justo | Portfólio de TI",
    "description": "Portfólio profissional de Roberto Justo - Líder Técnico de Front-End especializado em Salesforce, com experiência em projetos nacionais e internacionais de e-commerce B2B."
  },
  "nav": {
    "home": "Início",
    "personal": "Sobre Mim",
    "projects": "Projetos",
    "skills": "Habilidades",
    "contact": "Contato",
    "curiosities": "Curiosidades"
  },
  "header": {
    "menu": "Menu",
    "closeMenu": "Fechar menu",
    "selectLanguage": "Selecionar idioma"
  },
  "footer": {
    "madeBy": "Desenvolvido por",
    "allRights": "Todos os direitos reservados.",
    "language": "Idioma"
  },
  "home": {
    "title": "Início",
    "heroTitle": "Olá, eu sou",
    "heroName": "Roberto Justo",
    "heroSubtitle": "Líder Técnico de Front-End & Desenvolvedor Salesforce",
    "heroDescription": "Com anos de experiência em desenvolvimento web, atuo na criação e arquitetura de aplicações Salesforce, com foco em e-commerces B2B para clientes nacionais e internacionais. Lidero equipes de front-end, colaborando com diferentes times para garantir soluções eficientes e escaláveis.",
    "storiesTitle": "Minha Jornada",
    "storiesSubtitle": "Marcos importantes na minha carreira",
    "summaryTitle": "Resumo Profissional",
    "summaryText": "Líder Técnico de Front-End com sólida experiência em desenvolvimento web e arquitetura de aplicações Salesforce. Minha atuação vai além do código: participo de reuniões estratégicas, utilizo metodologias ágeis e contribuo para decisões técnicas. Me reúno diretamente com clientes e equipes de DevOps, garantindo que as soluções estejam alinhadas às necessidades do negócio. Comprometido com boas práticas, qualidade, performance e inovação, atualmente também construo features e projetos com inteligência artificial, utilizando agentes para garantir melhor qualidade, testes, agilidade e escalabilidade.",
    "summaryHighlight1": "Anos de Experiência",
    "summaryHighlight2": "Projetos Entregues",
    "summaryHighlight3": "Mercados Globais",
    "summaryHighlight4": "Tecnologias Dominadas",
    "viewProjects": "Ver Projetos",
    "contactMe": "Fale Comigo",
    "stories": {
      "story1": { "title": "Universidade", "year": "2010", "description": "Ingresso em Sistemas de Informação na UFRRJ, após excelente nota no ENEM e formação técnica pela FAETEC" },
      "story2": { "title": "Primeiros Estágios", "year": "2011", "description": "Estágios em TI na UFRRJ (DTA e COINFO), manutenção de redes e criação de portais web" },
      "story3": { "title": "Experiência Corporativa", "year": "2013", "description": "Estágios na Hildebrando Brasil e Globo.com, atuando com infraestrutura e sistemas operacionais" },
      "story4": { "title": "Instrutor na UFRRJ", "year": "2014", "description": "Instrutor no CODEP/UFRRJ, ministrando curso de Planilha Eletrônica para funcionários da universidade por 2 anos" },
      "story5": { "title": "Trainee em Desenvolvimento", "year": "2017", "description": "Trainee na HS Informática, atuando com suporte ao produto e desenvolvimento de aplicações web em PHP com framework MVC" },
      "story6": { "title": "Entrada no Salesforce", "year": "2018", "description": "Início na iPremios como Salesforce Developer, estilizando portais B2B para grandes clientes" },
      "story7": { "title": "Projetos Globais", "year": "2020", "description": "Participação em projetos internacionais como OmniRep e Commerce Lite para mercados globais" },
      "story8": { "title": "Tech Lead Front-End", "year": "2022", "description": "Promoção a Líder Técnico de Front-End, liderando equipe no projeto All in One" },
      "story9": { "title": "Expansão Global", "year": "2024", "description": "Liderança de front-end em 5 mercados: Brasil, Chile, Romênia, África do Sul e Polônia" },
      "story10": { "title": "IA & Inovação", "year": "2026", "description": "Construção de features e projetos com inteligência artificial e agentes de IA" }
    }
  },
  "personal": {
    "title": "Sobre Mim",
    "subtitle": "Conheça minha história e trajetória",
    "bio": "Com anos de experiência em desenvolvimento web, atuo principalmente na criação e arquitetura de aplicações para Salesforce, com foco em e-commerces para clientes nacionais e internacionais. Sou comprometido com boas práticas de desenvolvimento, sempre buscando qualidade, performance e inovação. Além disso, me considero uma pessoa educada, sociável e determinada, que valoriza a transparência e a seriedade no trabalho.",
    "timelineTitle": "Minha Linha do Tempo",
    "timelineSubtitle": "Marcos da minha jornada",
    "info": {
      "location": "Localização",
      "locationValue": "Rio de Janeiro, Brasil",
      "education": "Formação",
      "educationValue": "Sistemas de Informação - UFRRJ",
      "experience": "Experiência",
      "experienceValue": "15+ anos em TI",
      "languages": "Idiomas",
      "languagesValue": "Português, Inglês, Espanhol"
    },
    "timeline": {
      "event1": { "date": "2010", "title": "Universidade", "description": "Ingresso em Sistemas de Informação na UFRRJ, após aprovação no ENEM e cursos técnicos na FAETEC" },
      "event2": { "date": "2011", "title": "Estágio - DTA UFRRJ", "description": "Manutenção de rede, criação de portal web e suporte de hardware/software no laboratório de informática" },
      "event3": { "date": "2012", "title": "Estágio - COINFO UFRRJ", "description": "Manutenção da rede de computadores da universidade, suporte nível 2 e 3" },
      "event4": { "date": "2013", "title": "Hildebrando & Globo.com", "description": "Estágios em infraestrutura na Hildebrando Brasil e suporte a sistemas operacionais na Globo.com" },
      "event5": { "date": "2014", "title": "Instrutor - CODEP UFRRJ", "description": "Ministrei curso de Planilha Eletrônica para funcionários da UFRRJ por 2 anos" },
      "event6": { "date": "2017", "title": "Trainee - HS Informática", "description": "Suporte ao produto e desenvolvimento de aplicações web em PHP com framework MVC" },
      "event7": { "date": "2018", "title": "Salesforce Developer - iPremios", "description": "Início como Salesforce Developer, trabalhando em portais B2B para grandes clientes nacionais" },
      "event8": { "date": "2022", "title": "Tech Lead Front-End", "description": "Promoção a Líder Técnico de Front-End, liderando equipe no projeto All in One com alcance global" }
    }
  },
  "projects": {
    "title": "Projetos",
    "subtitle": "Principais projetos em que contribuí",
    "viewMore": "Ver Detalhes",
    "technologies": "Tecnologias Utilizadas",
    "role": "Meu Papel",
    "duration": "Duração",
    "project1": {
      "name": "All in One (AIO)",
      "description": "Portal robusto dentro do Salesforce com mais de 90 páginas, funcionando como e-commerce e portal B2B. Permite que varejistas comprem produtos, acessem promoções e garantam descontos. Além disso, o varejista pode participar de programas de benefícios, acumulando pontos e trocando por prêmios. Disponível em 5 mercados — Brasil, Chile, Romênia, África do Sul e Polônia — cada um com particularidades desenvolvidas especialmente para atender o cliente local.",
      "role": "Líder Técnico de Front-End",
      "duration": "3+ anos (em andamento)",
      "techs": "Salesforce LWC, Apex, JavaScript, CSS, SOQL"
    },
    "project2": {
      "name": "Commerce Lite",
      "description": "Portal Lite dentro do Salesforce que permitia ao varejista da BAT comprar produtos, atingir promoções e acompanhar pedidos em poucas telas. Uma solução ágil e eficiente, implantada nos mercados de Brasil, Polônia, Malásia e África do Sul.",
      "role": "Desenvolvedor Front-End",
      "duration": "2 anos",
      "techs": "Salesforce Aura Component, Apex, JavaScript, CSS"
    },
    "project3": {
      "name": "OmniRep",
      "description": "Portal dentro do Salesforce voltado para representantes de venda da BAT, com gráficos demonstrativos de vendas e compras organizados por hierarquia — Área, Regional, Território e Varejista. Implantado nos mercados de Brasil, África do Sul e Nova Zelândia.",
      "role": "Desenvolvedor Front-End",
      "duration": "1 ano",
      "techs": "Salesforce Aura Component, JavaScript, CSS"
    },
    "project4": {
      "name": "Commerce IQ (AIO)",
      "description": "Feature integrada ao All in One com o objetivo de oferecer produtos definidos por métricas inteligentes. Uma engine classifica produtos para o varejista, como: itens comprados juntos, produtos similares e itens ainda não adquiridos. O portal exibe esses produtos em carrosséis dinâmicos e com interações ao passar o mouse, revelando recomendações personalizadas. Presente nos mercados de Brasil, Chile e África do Sul.",
      "role": "Desenvolvedor Front-End",
      "duration": "1 ano (em andamento)",
      "techs": "Salesforce LWC, Apex, JavaScript, CSS, SOQL"
    },
    "project5": {
      "name": "Promotions (AIO)",
      "description": "Feature dentro do All in One para oferecer promoções nos produtos comprados pelo varejista. As promoções são cadastradas em um portal administrativo e sincronizadas com o Salesforce. O usuário pode combinar múltiplas promoções com targets e rewards distintos, além de níveis progressivos de atingimento — quanto maior o target, maior o reward. No portal, o varejista acompanha seus targets, visualiza o progresso e confirma a conquista das recompensas. Presente em Brasil, Chile e África do Sul.",
      "role": "Líder Técnico Front-End",
      "duration": "2+ anos (em andamento)",
      "techs": "Salesforce LWC, Apex, JavaScript, CSS, SOQL, Grails, ZK"
    },
    "project6": {
      "name": "BAT Elite",
      "description": "Projeto integrado ao All in One (Romênia) do Salesforce, porém construído fora do ecossistema Salesforce. É um portal B2B que permite ao usuário acumular pontos ao atingir objetivos por meio de diversas dinâmicas, e resgatar esses pontos em troca de prêmios. Atualmente operando no mercado da Romênia.",
      "role": "Desenvolvedor Front-End",
      "duration": "8 meses (em andamento)",
      "techs": "React, Next.js"
    },
    "project7": {
      "name": "B2B Commerce",
      "description": "Portal e-commerce dentro do Salesforce voltado para varejistas, permitindo a compra de produtos atrelados a promoções com diversas dinâmicas de descontos, todas visualizadas em tempo real na tela. O grande desafio técnico deste projeto foi trabalhar com o framework CloudCraze, devido às suas especificidades e complexidade inerentes.",
      "role": "Desenvolvedor Front-End",
      "duration": "1 ano",
      "techs": "CloudCraze, JavaScript, jQuery, CSS"
    }
  },
  "skills": {
    "title": "Habilidades",
    "subtitle": "Competências técnicas e pessoais",
    "technicalTitle": "Habilidades Técnicas",
    "personalTitle": "Habilidades Pessoais",
    "technical": {
      "frontend": "Desenvolvimento Front-End",
      "backend": "Salesforce & Backend",
      "mobile": "Frameworks & Ferramentas",
      "database": "Banco de Dados & Queries",
      "cloud": "DevOps & Metodologias",
      "architecture": "Arquitetura & Escalabilidade"
    },
    "personalSkills": {
      "leadership": "Liderança Técnica",
      "leadershipDesc": "Liderança de equipes de front-end em projetos globais com múltiplos mercados",
      "communication": "Comunicação",
      "communicationDesc": "Reuniões diretas com clientes e equipes de DevOps, garantindo alinhamento estratégico",
      "problemSolving": "Resolução de Problemas",
      "problemSolvingDesc": "Abordagem analítica para desafios complexos em arquiteturas Salesforce",
      "teamwork": "Trabalho em Equipe",
      "teamworkDesc": "Colaboração com diferentes times e metodologias ágeis",
      "adaptability": "Adaptabilidade",
      "adaptabilityDesc": "Atuação em diversos mercados internacionais com culturas e necessidades distintas",
      "creativity": "Inovação com IA",
      "creativityDesc": "Construção de features e projetos com inteligência artificial e agentes de IA"
    }
  },
  "contact": {
    "title": "Contato",
    "subtitle": "Vamos nos conectar e trabalhar juntos",
    "formTitle": "Envie-me uma mensagem",
    "name": "Nome",
    "email": "Email",
    "subject": "Assunto",
    "message": "Mensagem",
    "send": "Enviar Mensagem",
    "info": {
      "emailTitle": "Email",
      "emailValue": "roberto@example.com",
      "phoneTitle": "Telefone",
      "phoneValue": "+55 (11) 99999-9999",
      "locationTitle": "Localização",
      "locationValue": "Rio de Janeiro, Brasil",
      "linkedinTitle": "LinkedIn",
      "githubTitle": "GitHub"
    },
    "successMessage": "Mensagem enviada com sucesso!",
    "namePlaceholder": "Seu nome",
    "emailPlaceholder": "seu@email.com",
    "subjectPlaceholder": "Assunto da mensagem",
    "messagePlaceholder": "Sua mensagem..."
  },
  "curiosities": {
    "title": "Curiosidades",
    "subtitle": "Fatos divertidos e interesses sobre mim",
    "items": {
      "item1": { "title": "Amante do Futebol", "description": "Acompanho futebol desde sempre. Adoro assistir competições ao redor do mundo e fico ainda mais animado em época de Copa do Mundo — um verdadeiro apaixonado pelo esporte." },
      "item2": { "title": "Música", "description": "Sou apaixonado por música, especialmente rock clássico e os grandes hits dos anos 70 e 80. Uma boa playlist é companhia certa no dia a dia." },
      "item3": { "title": "Amizade", "description": "Valorizo muito estar com amigos. Reunir a turma para uma boa conversa, comida gostosa e uma cervejinha gelada é um dos meus maiores prazeres." },
      "item4": { "title": "Gaming", "description": "Gosto de videogames, principalmente clássicos como FIFA, Mortal Kombat e Need for Speed. Sou fã de games retrô — Street Fighter, The King of Fighters, Gran Turismo e outros títulos de PS1 e Mega Drive." },
      "item5": { "title": "Aprendizado Contínuo", "description": "Todos os dias me dedico a aprender algo novo, mesmo que não seja da minha área. A curiosidade é o motor que me mantém evoluindo constantemente." },
      "item6": { "title": "Adaptabilidade", "description": "Me adapto com facilidade a qualquer ambiente ou desafio. Consigo realizar praticamente qualquer tarefa que me é ensinada e faço amizade fácil com todo tipo de pessoa." },
      "item7": { "title": "Família", "description": "Amo minha família. Hoje meu mundo gira em torno da minha esposa Fernanda e da nossa cachorra Malu. Aproveitar cada momento ao lado delas é o que me faz mais feliz." },
      "item8": { "title": "Viajar", "description": "Adoro conhecer novos lugares e viver cada momento da viagem ao máximo. Quando chega a hora de voltar, a vontade é sempre ficar um pouco mais." },
      "item9": { "title": "Dirigir", "description": "Pelo incrível que pareça, adoro pegar a estrada — sozinho ou em família. Dirigir me faz bem e me relaxa. Também sou fã de carros antigos; se pudesse, teria um modelo clássico só como hobby." }
    }
  }
}
